{
  "displayName": "CA-AUT001-PrivAccounts-RequirePhishResistantMFA",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": ["REPLACE_WITH_GLOBAL_ADMINS_GROUP_OBJECT_ID"],
      "excludeGroups": ["REPLACE_WITH_EMERGENCY_ACCESS_GROUP_OBJECT_ID"],
      "includeRoles": [],
      "excludeRoles": []
    },
    "applications": {
      "includeApplications": ["All"],
      "excludeApplications": []
    },
    "clientAppTypes": ["all"]
  },
  "grantControls": {
    "operator": "AND",
    "builtInControls": [],
    "authenticationStrength": {
      "id": "REPLACE_WITH_PHISHING_RESISTANT_MFA_STRENGTH_ID"
    }
  }
}
