{
  "displayName": "CA-COV002-AllUsers-RequireMFA",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": ["All"],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [
        "REPLACE_WITH_EMERGENCY_ACCESS_GROUP_OBJECT_ID",
        "REPLACE_WITH_WORKLOAD_IDENTITIES_GROUP_OBJECT_ID"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "applications": {
      "includeApplications": ["All"],
      "excludeApplications": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["mfa"]
  }
}
